DataProcessors/ВыгрузкаДанныхВXLSX.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузкаДанныхВXLSX</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключатьОфисные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/РасчетыПоЛицевымСчетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоЛицевымСчетам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейНачислено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтимулирующийТариф</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порог</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорогиТарифовУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПорога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисленияПерерасчет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЛицевыеСчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПрописанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПроживающих</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОтветственныйВладелецЛицевогоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныйВладелецЛицевогоСчета</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтветственныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УстановленныеПриборыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>УстановленныеПриборыУчета</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СреднемесячноеПоказание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МестоРазмещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПрибора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСледующейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПоказанияПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПоказанияПриборовУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиПоказаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПоказанияПриборовЗаМесяц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПоказанияПриборовЗаМесяц</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоказаниеПредыдущее</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Разница</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НачислениеПоСреднему</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЛицевогоСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтветственныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыНачислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Субсидия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Льгота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазовоеНачисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корректировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегиональнаяСубсидия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КачествоУслуги</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ВыгрузкаДанныхВXLSX/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.Дата = НачалоДня(ТекущаяДата());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Режим = РежимДиалогаВыбораФайла.Сохранение;
	ДиалогФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогФайла.ПолноеИмяФайла = Объект.Файл;
	ДиалогФайла.Фильтр = "Книга Excel (*.xlsx)|*.xlsx";
	ДиалогФайла.Расширение = "xlsx";
	ДиалогФайла.МножественныйВыбор = Ложь;
	ДиалогФайла.Заголовок = НСтр("ru='Укажите файл для сохранения';uk='Вкажіть файл для збереження'");
	Если ДиалогФайла.Выбрать() Тогда
		Объект.Файл = ДиалогФайла.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьВыгрузку(Команда)

	Если НЕ ЗначениеЗаполнено(Объект.Файл) Тогда
		Предупреждение(НСтр("ru='Укажите файл для сохранения.';uk='Вкажіть файл для збереження.'"));
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.Дата = НачалоДня(ТекущаяДата());
	КонецЕсли;

	Таб = Новый ТабличныйДокумент();
	КоличествоСтрок = 0;
	Таб = ЗаполнитьТабличныйДокументНаСервере(Таб, КоличествоСтрок);

	Попытка
		Таб.Записать(Объект.Файл, ТипФайлаТабличногоДокумента.XLSX);
	Исключение
		Предупреждение(НСтр("ru='Не удалось записать файл: ';uk='Не вдалося записати файл: '") + ОписаниеОшибки());
		Возврат;
	КонецПопытки;

	Сообщить(СтрШаблон(НСтр("ru='Выгрузка сформирована. Строк: %1. Файл: %2';uk='Вивантаження сформовано. Рядків: %1. Файл: %2'"),
		КоличествоСтрок, Объект.Файл));

КонецПроцедуры

&НаСервере
Функция ЗаполнитьТабличныйДокументНаСервере(Таб, КоличествоСтрок)

	ДанныеВыгрузки = ПолучитьДанныеВыгрузки();

	// Заголовки колонок (один аркуш, ключовий реквізит — Особовий рахунок)
	Заголовки = Новый Массив;
	Заголовки.Добавить("Особовий рахунок");
	Заголовки.Добавить("Об'єкт особового рахунку");
	Заголовки.Добавить("Об'єкт обліку");
	Заголовки.Добавить("Відповідальний власник");
	Заголовки.Добавить("Телефон");
	Заголовки.Добавить("Мобільний телефон");
	Заголовки.Добавить("Взаєморозрахунки");
	Заголовки.Добавить("КодКОАТУУ");
	Заголовки.Добавить("Бойлер");
	Заголовки.Добавить("Не проживають");
	Заголовки.Добавить("Коментар");
	Заголовки.Добавить("Прописано");
	Заголовки.Добавить("Прилад обліку");
	Заголовки.Добавить("Послуга");
	Заголовки.Добавить("Коефіцієнт");
	Заголовки.Добавить("Попередній показник");
	Заголовки.Добавить("Поточний показник");
	Заголовки.Добавить("Дата провірки");
	Заголовки.Добавить("Період нарахування");
	Заголовки.Добавить("Нараховано");
	Заголовки.Добавить("Дата оплати");
	Заголовки.Добавить("Сума оплати");
	Заголовки.Добавить("НачислениеПоСреднему");
	Заголовки.Добавить("Пароль");
	Заголовки.Добавить("Приватний сектор");

	Для НомерКолонки = 1 По Заголовки.Количество() Цикл
		Ячейка = Таб.Область(1, НомерКолонки);
		Ячейка.Текст = Заголовки[НомерКолонки - 1];
		Ячейка.ЦветФона = WebЦвета.СветлоСерый;
		Ячейка.Шрифт = Новый Шрифт(, , Истина);
		Ячейка.ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
	КонецЦикла;

	НомерСтроки = 2;
	Для Каждого Стр Из ДанныеВыгрузки Цикл

		НомерПрибора = СокрЛП(Стр.ЗаводскойНомер);
		ТипПрибора = СокрЛП(Стр.ТипПрибора);
		Если ПустаяСтрока(ТипПрибора) Тогда
			ТипПрибора = Строка(Стр.Услуга);
		КонецЕсли;
		ПриборСтрокой = СокрЛП(НомерПрибора + " " + ТипПрибора);

		КОАТУУБезПробела = СтрЗаменить(СокрЛП(Стр.КодКОАТУУ), " ", "");

		Таб.Область(НомерСтроки, 1).Текст  = Строка(Стр.ЛицевойСчет);
		Таб.Область(НомерСтроки, 2).Текст  = Строка(Стр.ОбъектЛицевогоСчета);
		Таб.Область(НомерСтроки, 3).Текст  = Строка(Стр.Здание);
		Таб.Область(НомерСтроки, 4).Текст  = Строка(Стр.ОтветственныйВладелец);
		Таб.Область(НомерСтроки, 5).Текст  = ТелефонE164(Стр.Телефон);
		Таб.Область(НомерСтроки, 6).Текст  = ТелефонE164(Стр.МобТелефон);
		Таб.Область(НомерСтроки, 7).Текст  = Формат(Стр.Баланс, "ЧДЦ=2; ЧРД=.; ЧГ=0");
		Таб.Область(НомерСтроки, 8).Текст  = КОАТУУБезПробела;
		Таб.Область(НомерСтроки, 9).Текст  = ?(Стр.Бойлер, "Так", "");
		Таб.Область(НомерСтроки, 10).Текст = ?(Стр.НеЖивут, "Так", "");
		Таб.Область(НомерСтроки, 11).Текст = СокрЛП(Стр.Комментарий);
		Таб.Область(НомерСтроки, 12).Текст = Формат(Стр.Прописано, "ЧДЦ=0; ЧГ=0");
		Таб.Область(НомерСтроки, 13).Текст = ПриборСтрокой;
		Таб.Область(НомерСтроки, 14).Текст = Строка(Стр.Услуга);
		Таб.Область(НомерСтроки, 15).Текст = ?(Стр.Коэффициент = 0, "", Формат(Стр.Коэффициент, "ЧДЦ=4; ЧРД=.; ЧГ=0"));
		Таб.Область(НомерСтроки, 16).Текст = ?(НомерПрибора = "", "", Формат(Стр.ПредыдущийПоказатель, "ЧДЦ=2; ЧРД=.; ЧГ=0"));
		Таб.Область(НомерСтроки, 17).Текст = ?(НомерПрибора = "", "", Формат(Стр.ТекущийПоказатель, "ЧДЦ=2; ЧРД=.; ЧГ=0"));
		Таб.Область(НомерСтроки, 18).Текст = ?(ЗначениеЗаполнено(Стр.ДатаПоверки), Формат(Стр.ДатаПоверки, "ДЛФ=D"), "");
		Таб.Область(НомерСтроки, 19).Текст = ?(ЗначениеЗаполнено(Стр.ПериодНачисления), Формат(Стр.ПериодНачисления, "ДФ=MM.yyyy"), "");
		Таб.Область(НомерСтроки, 20).Текст = Формат(Стр.Начислено, "ЧДЦ=2; ЧРД=.; ЧГ=0");
		Таб.Область(НомерСтроки, 21).Текст = ?(ЗначениеЗаполнено(Стр.ДатаОплаты), Формат(Стр.ДатаОплаты, "ДЛФ=D"), "");
		Таб.Область(НомерСтроки, 22).Текст = Формат(Стр.СуммаОплаты, "ЧДЦ=2; ЧРД=.; ЧГ=0");
		Таб.Область(НомерСтроки, 23).Текст = ?(Стр.НачислениеПоСреднему, "Истина", "Ложь");
		Таб.Область(НомерСтроки, 24).Текст = СокрЛП(Стр.Пароль);
		Таб.Область(НомерСтроки, 25).Текст = ?(Стр.ЧастныйСектор, "Так", "");

		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;

	Таб.ФиксацияСверху = 1;
	Таб.ОтображатьСетку = Истина;

	КоличествоСтрок = ДанныеВыгрузки.Количество();
	Возврат Таб;

КонецФункции

&НаСервере
Функция ТолькоЦифры(Текст)
	Результат = "";
	Для Поз = 1 По СтрДлина(Текст) Цикл
		Код = КодСимвола(Текст, Поз);
		Если Код >= 48 И Код <= 57 Тогда
			Результат = Результат + Символ(Код);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

// Приводить телефон до формату E.164 (Україна: +380XXXXXXXXX).
// Якщо номер не розпізнано — повертає вихідний текст без змін.
&НаСервере
Функция ТелефонE164(Текст)
	Исходный = СокрЛП(Строка(Текст));
	Цифры = ТолькоЦифры(Исходный);
	// Прибрати міжнародний префікс виходу "00"
	Если Лев(Цифры, 2) = "00" Тогда
		Цифры = Сред(Цифры, 3);
	КонецЕсли;
	Если ПустаяСтрока(Цифры) Тогда
		Возврат Исходный;
	КонецЕсли;
	Длина = СтрДлина(Цифры);
	Если Длина = 12 И Лев(Цифры, 3) = "380" Тогда
		Ядро = Цифры;
	ИначеЕсли Длина = 11 И Лев(Цифры, 2) = "80" Тогда
		Ядро = "3" + Цифры;
	ИначеЕсли Длина = 10 И Лев(Цифры, 1) = "0" Тогда
		Ядро = "380" + Сред(Цифры, 2);
	ИначеЕсли Длина = 9 Тогда
		Ядро = "380" + Цифры;
	Иначе
		Возврат Исходный;
	КонецЕсли;
	Возврат "+" + Ядро;
КонецФункции

&НаСервере
Функция ПолучитьДанныеВыгрузки()

	ГраницаДаты = КонецДня(Объект.Дата);
	КонецМесяца = КонецМесяца(Объект.Дата);

	// Параметричний відбір особових рахунків
	УсловияЛС = "НЕ ЛицевыеСчета.ПометкаУдаления";
	Если ЗначениеЗаполнено(Объект.ЛицевойСчет) Тогда
		УсловияЛС = УсловияЛС + "
		|	И ЛицевыеСчета.Ссылка = &ЛицевойСчет";
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Здание) Тогда
		УсловияЛС = УсловияЛС + "
		|	И ЛицевыеСчета.Владелец = &Здание";
	КонецЕсли;
	Если Объект.ИсключатьОфисные Тогда
		УсловияЛС = УсловияЛС + "
		|	И НЕ ЛицевыеСчета.ОбъектЛицевогоСчета.Наименование ПОДОБНО ""%оф.%""";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЛицевойСчет", Объект.ЛицевойСчет);
	Запрос.УстановитьПараметр("Здание", Объект.Здание);
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("ГраницаДаты", ГраницаДаты);
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца);
	Запрос.УстановитьПараметр("КонецМесяцаПред", ДобавитьМесяц(КонецМесяца, -1));
	Запрос.УстановитьПараметр("ВидНачисления", Перечисления.ВидыНачислений.Начисление);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	ЛицевыеСчета.ОбъектЛицевогоСчета КАК ОбъектЛицевогоСчета,
	|	ЛицевыеСчета.Владелец КАК Здание,
	|	ЛицевыеСчета.Владелец.ЧастныйСектор КАК ЧастныйСектор,
	|	ЛицевыеСчета.Телефон КАК Телефон,
	|	ЛицевыеСчета.МобТелефон КАК МобТелефон,
	|	ЛицевыеСчета.КодКОАТУУ КАК КодКОАТУУ,
	|	ЛицевыеСчета.Бойлер КАК Бойлер,
	|	ЛицевыеСчета.НеЖивут КАК НеЖивут,
	|	ЛицевыеСчета.Комментарий КАК Комментарий,
	|	ЛицевыеСчета.ПарольДоступа КАК Пароль
	|ПОМЕСТИТЬ ВТЛС
	|ИЗ
	|	Справочник.ЛицевыеСчета КАК ЛицевыеСчета
	|ГДЕ
	|	" + УсловияЛС + "
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.ЛицевойСчет КАК ЛицевойСчет,
	|	СУММА(Остатки.СуммаОстаток) КАК Баланс
	|ПОМЕСТИТЬ ВТБаланс
	|ИЗ
	|	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(&ГраницаДаты, ЛицевойСчет В (ВЫБРАТЬ ВТЛС.ЛицевойСчет ИЗ ВТЛС КАК ВТЛС)) КАК Остатки
	|СГРУППИРОВАТЬ ПО
	|	Остатки.ЛицевойСчет
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛицевыеСчетаСв.ЛицевойСчет КАК ЛицевойСчет,
	|	ЛицевыеСчетаСв.КоличествоПрописанных КАК Прописано
	|ПОМЕСТИТЬ ВТПрописано
	|ИЗ
	|	РегистрСведений.ЛицевыеСчета.СрезПоследних(&ГраницаДаты, ЛицевойСчет В (ВЫБРАТЬ ВТЛС.ЛицевойСчет ИЗ ВТЛС КАК ВТЛС)) КАК ЛицевыеСчетаСв
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Владельцы.ЛицевойСчет КАК ЛицевойСчет,
	|	Владельцы.ОтветственныйВладелец КАК ОтветственныйВладелец
	|ПОМЕСТИТЬ ВТВладелец
	|ИЗ
	|	РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&ГраницаДаты, ЛицевойСчет В (ВЫБРАТЬ ВТЛС.ЛицевойСчет ИЗ ВТЛС КАК ВТЛС)) КАК Владельцы
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КлючиПриборов.ЛицевойСчет КАК ЛицевойСчет,
	|	КлючиПриборов.Прибор КАК Прибор
	|ПОМЕСТИТЬ ВТКлючиПриборов
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫРАЗИТЬ(УстПУ.ОбъектУстановки КАК Справочник.ЛицевыеСчета) КАК ЛицевойСчет,
	|		УстПУ.ПриборУчета КАК Прибор
	|	ИЗ
	|		РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(&ГраницаДаты, ОбъектУстановки В (ВЫБРАТЬ ВТЛС.ЛицевойСчет ИЗ ВТЛС КАК ВТЛС)) КАК УстПУ
	|	ГДЕ
	|		УстПУ.Действует
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ПриборыУчета.ЛицевойСчет,
	|		ПриборыУчета.Ссылка
	|	ИЗ
	|		Справочник.ПриборыУчета КАК ПриборыУчета
	|	ГДЕ
	|		ПриборыУчета.ЛицевойСчет В (ВЫБРАТЬ ВТЛС.ЛицевойСчет ИЗ ВТЛС КАК ВТЛС)
	|		И НЕ ПриборыУчета.ПометкаУдаления) КАК КлючиПриборов
	|ГДЕ
	|	КлючиПриборов.ЛицевойСчет ЕСТЬ НЕ NULL
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТКлючиПриборов.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТКлючиПриборов.Прибор КАК Прибор,
	|	ВТКлючиПриборов.Прибор.ЗаводскойНомер КАК ЗаводскойНомер,
	|	ВТКлючиПриборов.Прибор.Коэффициент КАК Коэффициент,
	|	ВТКлючиПриборов.Прибор.Услуга КАК Услуга,
	|	ВТКлючиПриборов.Прибор.Здание КАК Здание
	|ПОМЕСТИТЬ ВТПриборы
	|ИЗ
	|	ВТКлючиПриборов КАК ВТКлючиПриборов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета КАК Прибор,
	|	УстановленныеПриборыУчетаСрезПоследних.ТипПрибора КАК ТипПрибора,
	|	УстановленныеПриборыУчетаСрезПоследних.ДатаСледующейПоверки КАК ДатаПоверки
	|ПОМЕСТИТЬ ВТУстановленные
	|ИЗ
	|	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(&ГраницаДаты, ПриборУчета В (ВЫБРАТЬ ВТПриборы.Прибор ИЗ ВТПриборы КАК ВТПриборы)) КАК УстановленныеПриборыУчетаСрезПоследних
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Тек.ПриборУчета КАК Прибор,
	|	СУММА(Тек.Значение) КАК ТекущийПоказатель
	|ПОМЕСТИТЬ ВТПоказанияТек
	|ИЗ
	|	РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(&КонецМесяца, ПриборУчета В (ВЫБРАТЬ ВТПриборы.Прибор ИЗ ВТПриборы КАК ВТПриборы)) КАК Тек
	|СГРУППИРОВАТЬ ПО
	|	Тек.ПриборУчета
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Пред.ПриборУчета КАК Прибор,
	|	СУММА(Пред.Значение) КАК ПредыдущийПоказатель
	|ПОМЕСТИТЬ ВТПоказанияПред
	|ИЗ
	|	РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(&КонецМесяцаПред, ПриборУчета В (ВЫБРАТЬ ВТПриборы.Прибор ИЗ ВТПриборы КАК ВТПриборы)) КАК Пред
	|СГРУППИРОВАТЬ ПО
	|	Пред.ПриборУчета
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоказанияЗаМесяцСрезПоследних.ПриборУчета КАК Прибор,
	|	МАКСИМУМ(ПоказанияЗаМесяцСрезПоследних.НачислениеПоСреднему) КАК НачислениеПоСреднему
	|ПОМЕСТИТЬ ВТСреднее
	|ИЗ
	|	РегистрСведений.ПоказанияПриборовЗаМесяц.СрезПоследних(&КонецМесяца, ПриборУчета В (ВЫБРАТЬ ВТПриборы.Прибор ИЗ ВТПриборы КАК ВТПриборы)) КАК ПоказанияЗаМесяцСрезПоследних
	|СГРУППИРОВАТЬ ПО
	|	ПоказанияЗаМесяцСрезПоследних.ПриборУчета
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Начисления.ЛицевойСчет КАК ЛицевойСчет,
	|	МАКСИМУМ(Начисления.МесяцНачисления) КАК ПериодНачисления
	|ПОМЕСТИТЬ ВТПоследнийПериод
	|ИЗ
	|	РегистрНакопления.РасчетыПоЛицевымСчетам КАК Начисления
	|ГДЕ
	|	Начисления.ЛицевойСчет В (ВЫБРАТЬ ВТЛС.ЛицевойСчет ИЗ ВТЛС КАК ВТЛС)
	|	И Начисления.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Начисления.ВидНачисления = &ВидНачисления
	|	И Начисления.МесяцНачисления <= &КонецМесяца
	|СГРУППИРОВАТЬ ПО
	|	Начисления.ЛицевойСчет
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Начисления.ЛицевойСчет КАК ЛицевойСчет,
	|	СУММА(Начисления.Сумма) КАК Начислено
	|ПОМЕСТИТЬ ВТНачислено
	|ИЗ
	|	РегистрНакопления.РасчетыПоЛицевымСчетам КАК Начисления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПоследнийПериод КАК ВТПоследнийПериод
	|		ПО Начисления.ЛицевойСчет = ВТПоследнийПериод.ЛицевойСчет
	|			И Начисления.МесяцНачисления = ВТПоследнийПериод.ПериодНачисления
	|ГДЕ
	|	Начисления.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Начисления.ВидНачисления = &ВидНачисления
	|СГРУППИРОВАТЬ ПО
	|	Начисления.ЛицевойСчет
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Оплаты.ЛицевойСчет КАК ЛицевойСчет,
	|	МАКСИМУМ(Оплаты.Регистратор.Дата) КАК ДатаОплаты
	|ПОМЕСТИТЬ ВТПоследняяОплата
	|ИЗ
	|	РегистрНакопления.РасчетыПоЛицевымСчетам КАК Оплаты
	|ГДЕ
	|	Оплаты.ЛицевойСчет В (ВЫБРАТЬ ВТЛС.ЛицевойСчет ИЗ ВТЛС КАК ВТЛС)
	|	И Оплаты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Оплаты.Регистратор.Дата <= &ГраницаДаты
	|	И (Оплаты.Регистратор ССЫЛКА Документ.ПоступлениеВКассу
	|			ИЛИ Оплаты.Регистратор ССЫЛКА Документ.ПоступлениеНаСчет
	|			ИЛИ Оплаты.Регистратор ССЫЛКА Документ.ОплатаУслугМВК
	|			ИЛИ Оплаты.Регистратор ССЫЛКА Документ.ЧекККМ)
	|СГРУППИРОВАТЬ ПО
	|	Оплаты.ЛицевойСчет
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Оплаты.ЛицевойСчет КАК ЛицевойСчет,
	|	СУММА(Оплаты.Сумма) КАК СуммаОплаты
	|ПОМЕСТИТЬ ВТСуммаОплаты
	|ИЗ
	|	РегистрНакопления.РасчетыПоЛицевымСчетам КАК Оплаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПоследняяОплата КАК ВТПоследняяОплата
	|		ПО Оплаты.ЛицевойСчет = ВТПоследняяОплата.ЛицевойСчет
	|			И Оплаты.Регистратор.Дата = ВТПоследняяОплата.ДатаОплаты
	|ГДЕ
	|	Оплаты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И (Оплаты.Регистратор ССЫЛКА Документ.ПоступлениеВКассу
	|			ИЛИ Оплаты.Регистратор ССЫЛКА Документ.ПоступлениеНаСчет
	|			ИЛИ Оплаты.Регистратор ССЫЛКА Документ.ОплатаУслугМВК
	|			ИЛИ Оплаты.Регистратор ССЫЛКА Документ.ЧекККМ)
	|СГРУППИРОВАТЬ ПО
	|	Оплаты.ЛицевойСчет
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЛС.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТЛС.ОбъектЛицевогоСчета КАК ОбъектЛицевогоСчета,
	|	ВТЛС.Здание КАК Здание,
	|	ВТЛС.Телефон КАК Телефон,
	|	ВТЛС.МобТелефон КАК МобТелефон,
	|	ВТЛС.КодКОАТУУ КАК КодКОАТУУ,
	|	ВТЛС.Бойлер КАК Бойлер,
	|	ВТЛС.НеЖивут КАК НеЖивут,
	|	ВТЛС.Комментарий КАК Комментарий,
	|	ЕСТЬNULL(ВТВладелец.ОтветственныйВладелец, """") КАК ОтветственныйВладелец,
	|	ЕСТЬNULL(ВТБаланс.Баланс, 0) КАК Баланс,
	|	ЕСТЬNULL(ВТПрописано.Прописано, 0) КАК Прописано,
	|	ЕСТЬNULL(ВТПриборы.ЗаводскойНомер, """") КАК ЗаводскойНомер,
	|	ЕСТЬNULL(ВТПриборы.Коэффициент, 0) КАК Коэффициент,
	|	ВТПриборы.Услуга КАК Услуга,
	|	ЕСТЬNULL(ВТУстановленные.ТипПрибора, """") КАК ТипПрибора,
	|	ВТУстановленные.ДатаПоверки КАК ДатаПоверки,
	|	ЕСТЬNULL(ВТПоказанияПред.ПредыдущийПоказатель, 0) КАК ПредыдущийПоказатель,
	|	ЕСТЬNULL(ВТПоказанияТек.ТекущийПоказатель, 0) КАК ТекущийПоказатель,
	|	ВТПоследнийПериод.ПериодНачисления КАК ПериодНачисления,
	|	ЕСТЬNULL(ВТНачислено.Начислено, 0) КАК Начислено,
	|	ВТПоследняяОплата.ДатаОплаты КАК ДатаОплаты,
	|	ЕСТЬNULL(ВТСуммаОплаты.СуммаОплаты, 0) КАК СуммаОплаты,
	|	ЕСТЬNULL(ВТСреднее.НачислениеПоСреднему, ЛОЖЬ) КАК НачислениеПоСреднему,
	|	ВТЛС.Пароль КАК Пароль,
	|	ЕСТЬNULL(ВТЛС.ЧастныйСектор, ЛОЖЬ) КАК ЧастныйСектор
	|ИЗ
	|	ВТЛС КАК ВТЛС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБаланс КАК ВТБаланс
	|		ПО ВТЛС.ЛицевойСчет = ВТБаланс.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПрописано КАК ВТПрописано
	|		ПО ВТЛС.ЛицевойСчет = ВТПрописано.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВладелец КАК ВТВладелец
	|		ПО ВТЛС.ЛицевойСчет = ВТВладелец.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПриборы КАК ВТПриборы
	|		ПО ВТЛС.ЛицевойСчет = ВТПриборы.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУстановленные КАК ВТУстановленные
	|		ПО ВТПриборы.Прибор = ВТУстановленные.Прибор
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоказанияТек КАК ВТПоказанияТек
	|		ПО ВТПриборы.Прибор = ВТПоказанияТек.Прибор
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоказанияПред КАК ВТПоказанияПред
	|		ПО ВТПриборы.Прибор = ВТПоказанияПред.Прибор
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоследнийПериод КАК ВТПоследнийПериод
	|		ПО ВТЛС.ЛицевойСчет = ВТПоследнийПериод.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачислено КАК ВТНачислено
	|		ПО ВТЛС.ЛицевойСчет = ВТНачислено.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоследняяОплата КАК ВТПоследняяОплата
	|		ПО ВТЛС.ЛицевойСчет = ВТПоследняяОплата.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСуммаОплаты КАК ВТСуммаОплаты
	|		ПО ВТЛС.ЛицевойСчет = ВТСуммаОплаты.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСреднее КАК ВТСреднее
	|		ПО ВТПриборы.Прибор = ВТСреднее.Прибор
	|УПОРЯДОЧИТЬ ПО
	|	ВТЛС.ЛицевойСчет";

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции
